{
    "route": [
        {
            "text": "What type of degree do you have/are you doing?",
            "answers": [
                {
                    "text": "Vocational",
                    "response": "A strong academic pedigree is essential and will stand you in very good stead.However, your degree discipline is not the most important consideration. What's more important is that you did well in it and that you gained something from studying the subject of your choice. Make sure you tell us how you think your degree has equipped you for this role."
                },
                {
                    "text": "Science-based",
                    "response": "A strong academic pedigree is essential and will stand you in very good stead.However, your degree discipline is not the most important consideration. What's more important is that you did well in it and that you gained something from studying the subject of your choice. Make sure you tell us how you think your degree has equipped you for this role."
                },
                {
                    "text": "Business",
                    "response": "A strong academic pedigree is essential and will stand you in very good stead.However, your degree discipline is not the most important consideration. What's more important is that you did well in it and that you gained something from studying the subject of your choice. Make sure you tell us how you think your degree has equipped you for this role."
                },
                {
                    "text": "Non-vocational",
                    "response": "A strong academic pedigree is essential and will stand you in very good stead.However, your degree discipline is not the most important consideration. What's more important is that you did well in it and that you gained something from studying the subject of your choice. Make sure you tell us how you think your degree has equipped you for this role."
                },
                {
                    "text": "Arts-based",
                    "response": "A strong academic pedigree is essential and will stand you in very good stead.However, your degree discipline is not the most important consideration. What's more important is that you did well in it and that you gained something from studying the subject of your choice. Make sure you tell us how you think your degree has equipped you for this role."
                }
            ]
        },
        {
            "text": "What leisure activities were/are you involved in at university?",
            "answers": [
                {
                    "text": "Sport",
                    "response": "You're a team player then? Strong teamwork skills are essential for an Area Manager role, as are being able to demonstrate ability in leadership, organisation and social skills, as you will be interacting with all sorts of people over the year and developing your own character too. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
                },
                {
                    "text": "Music/Drama",
                    "response": "We like to put on a good show too at Aldi. Dramatics aside, we need you to show us skills such as teamwork, leadership, organisation and commitment. As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is also essential. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
                },
                {
                    "text": "Socialising",
                    "response": "As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is essential. Tell us how you think your social life puts you in good stead for the position. We also want to see ways in which you have demonstrated teamwork, leadership, organisation and commitment. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
                },
                {
                    "text": "Travel",
                    "response": "What have you done that will help you travel to an Area Manager role? We want to see ways in which you have demonstrated teamwork, leadership, organisation and commitment – these will all put you in good stead in your work as an Area Manager. As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is also essential. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
                },
                {
                    "text": "Voluntary work",
                    "response": "Sounds interesting – tell us about it. If your preferred leisure activity involves teamwork, leadership, organisation and commitment, then it will stand you in good stead in your work as an Area Manager. As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is essential. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
                }
            ]
        },
        {
            "text": "What work experience do you have?",
            "answers": [
                {
                    "text": "None",
                    "response": "We assume no previous retail experience as the training we provide will comprehensively equip you for the role. So whilst we don't expect you to come armed with lots of retail experience, whatever you have could serve you well. Your recruitment is influenced by your attitude, approach and a desire to absorb the Aldi culture and systems so we look forward to hearing about everything else you have been filling your time with and why you think you deserve a place on the Graduate Scheme. "
                },
                {
                    "text": "Casual/Summer jobs",
                    "response": "We assume no previous retail experience as the training we provide will comprehensively equip you for the role, but any experience is helpful. We want you to show us how your experience will help you excel on the Aldi Graduate Scheme. Your recruitment is influenced by your attitude, approach and a desire to absorb the Aldi culture and systems. We'll then train you in the skills you need to succeed."
                },
                {
                    "text": "Work in retail",
                    "response": "That's great! Although we assume no previous retail experience, previous experience in a fast-paced retail environment will put you in good stead. We're interested, so tell us what you've learnt and how that will help you succeed on the Aldi Graduate Scheme."
                },
                {
                    "text": "Work abroad",
                    "response": "Sounds interesting – we look forward to hearing about it. How has your time spent abroad brought you to being a closer fit for our Graduate Scheme? We assume no previous retail experience as the training we provide will comprehensively equip you for the role. So whilst we don't expect you to come armed with lots of retail experience, whatever you have could serve you well and we love people who take initiative. Your recruitment is influenced by your attitude, approach and a desire to absorb the Aldi culture and systems. We'll then train you in the skills you need to succeed."
                }
            ]
        },
        {
            "text": "Why do you want to work at Aldi?",
            "answers": [
                {
                    "text": "The money is fantastic",
                    "response": "If the salary is the only thing that matters to you, maybe we should end our interest right here? Sure, we offer a market-leading remuneration package, but it's aimed at rewarding you for your time, effort and achievement in one of the most demanding and challenging training programmes in UK management. So if money is your main motivation, save yourself a stamp, don't bother sending us your application."
                },
                {
                    "text": "It sounds challenging",
                    "response": "We like the sound of you. The Aldi Graduate Scheme will definitely offer you that challenge. In return, we offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities."
                },
                {
                    "text": "Amazing prospects",
                    "response": "An Area Manager after one year – what better prospects could there be? It will be a challenging journey getting there but in return for all your hard work, we offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities"
                },
                {
                    "text": "For the chance to succeed",
                    "response": "In this fast-paced retail environment, return on personal investment couldn't be higher. We're looking for that person who is determined to go far, but willing to work to get there. In return, we offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities."
                },
                {
                    "text": "I want to work in retail",
                    "response": "Well you are looking in the right place! Aldi is a fast-paced retail environment, where you will have a lot asked of you but the experience you gain will be invaluable in your career development. We offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities in return for your hard work and dedication."
                }
            ]
        },
        {
            "text": "Which of the following describes you?",
            "answers": [
                {
                    "text": "Focused",
                    "response": "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides. Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
                },
                {
                    "text": "Flexible",
                    "response": "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
                },
                {
                    "text": "Intelligent",
                    "response": "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
                },
                {
                    "text": "Resourceful",
                    "response": "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
                },
                {
                    "text": "Charismatic",
                    "response": "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
                }
            ]
        },
        {
            "text": "Examine the following situations and see how you would respond: Local competition is growing with both new store openings and aggressive price activity from competitors. What's your next move?",
            "answers": [
                {
                    "text": "Wait and see. It's happening everywhere so someone will come up with an answer in the business",
                    "response": "Are you are the kind of person who, when faced with problems, prefers to simply sit there and wait for someone else to come up with a solution? Then we'd like to wish you good luck with your future career, with someone else! At Aldi, we're looking for people who think creatively and embrace responsibility, so heads-in-the-sand types need not apply."
                },
                {
                    "text": "Visit the competition, speak to colleagues and start planning a costed local response of in-store activity and in-town advertising",
                    "response": "Good answer! As an Area Manager you are tasked with driving sales. Competition in grocery retailing is a fact of life. Chief among the expectations placed upon you is an ability to apply your intellect to the problems that you face in business. We'll expect you to think creatively, set your store teams stretching goals and apply a commercial and convincing approach when developing plans for, amongst other things, advertising support for your stores. Anything is possible. But things won't happen unless you make them happen."
                },
                {
                    "text": "Raise the issue at the next Area Manager meeting with a clear analysis of the issues and a few proposals to respond",
                    "response": "Good answer! As an Area Manager you are tasked with driving sales. Competition in grocery retailing is a fact of life. Chief among the expectations placed upon you is an ability to apply your intellect to the problems that you face in business. We'll expect you to think creatively, set your store teams stretching goals and apply a commercial and convincing approach when developing plans for, amongst other things, advertising support for your stores. Anything is possible. But things won't happen unless you make them happen."
                }
            ]
        },
        {
            "text": "Examine the following situations and see how you would respond: A Store Manager in your area is experiencing problems with staff turnover. How do you solve this?",
            "answers": [
                {
                    "text": "Do nothing. It's the Store Manager's responsibility!",
                    "response": "Do nothing? Do us a favour! Now you've ticked this as an answer maybe you should follow your own advice and do nothing when it comes to applying for place in the Area Management Programme. The simple fact is that any concern of a Store Manager under your jurisdiction has to be a concern of yours. And there's no room at Aldi for such an abdication of responsibility."
                },
                {
                    "text": "Make an assessment of the morale within the store and discuss it with the Store Manager",
                    "response": "At Aldi we employ the grandfather principle of hiring. As an Area Manager you are responsible for recruiting store staff for the Store Manager. As such, you may want to reflect on your own ability to hire great people as well as satisfy yourself that induction and training plans are in place. Your relationship with the Store Manager and your interest and enthusiasm for the store staff will have a profound effect on morale and the culture in which you all work."
                },
                {
                    "text": "Hire more people. Reassess the entire recruitment process",
                    "response": "At Aldi we employ the grandfather principle of hiring. As an Area Manager you are responsible for recruiting store staff for the Store Manager. As such, you may want to reflect on your own ability to hire great people as well as satisfy yourself that induction and training plans are in place. Your relationship with the Store Manager and your interest and enthusiasm for the store staff will have a profound effect on morale and the culture in which you all work."
                },
                {
                    "text": "Express your concern and set a target for retention",
                    "response": "At Aldi we employ the grandfather principle of hiring. As an Area Manager you are responsible for recruiting store staff for the Store Manager. As such, you may want to reflect on your own ability to hire great people as well as satisfy yourself that induction and training plans are in place. Your relationship with the Store Manager and your interest and enthusiasm for the store staff will have a profound effect on morale and the culture in which you all work."
                },
                {
                    "text": "Look into the induction and training procedures in the store",
                    "response": "At Aldi we employ the grandfather principle of hiring. As an Area Manager you are responsible for recruiting store staff for the Store Manager. As such, you may want to reflect on your own ability to hire great people as well as satisfy yourself that induction and training plans are in place. Your relationship with the Store Manager and your interest and enthusiasm for the store staff will have a profound effect on morale and the culture in which you all work."
                }
            ]
        },
        {
            "text": "Examine the following situations and see how you would respond: One of your stores is missing efficiency targets and you think that you know some of the factors contributing to this. Do you:",
            "answers": [
                {
                    "text": "Do nothing but check you are right by instructing the Store Manager to follow procedures",
                    "response": "Performance in our stores is always achieved through good leadership. The challenge of correcting poor performance and improving further good performances from incomplete information will require you to identify problems, devise solutions and apply resources whilst energising and encouraging your people to ultimately resolve issues themselves. Your knowledge, communication skills and ability to win people over will lead you to set and exceed targets which contribute to Aldi's success."
                },
                {
                    "text": "Spend time in other stores identifying how they hit targets and prepare plans to apply the knowledge in your struggling store",
                    "response": "Performance in our stores is always achieved through good leadership. The challenge of correcting poor performance and improving further good performances from incomplete information will require you to identify problems, devise solutions and apply resources whilst energising and encouraging your people to ultimately resolve issues themselves. Your knowledge, communication skills and ability to win people over will lead you to set and exceed targets which contribute to Aldi's success."
                },
                {
                    "text": "Acknowledge the missed target, discuss this with the Store Manager and discover what thoughts they have about the problem",
                    "response": "Performance in our stores is always achieved through good leadership. The challenge of correcting poor performance and improving further good performances from incomplete information will require you to identify problems, devise solutions and apply resources whilst energising and encouraging your people to ultimately resolve issues themselves. Your knowledge, communication skills and ability to win people over will lead you to set and exceed targets which contribute to Aldi's success."
                }
            ]
        },
        {
            "text": "Examine the following situations and see how you would respond: You've completed your training after 11 months and you're given an area of four stores to run. Where do you start? Do you:",
            "answers": [
                {
                    "text": "Hit the ground running by redefining store objectives with each Store Manager",
                    "response": "Your initial training will certainly equip you with the basic knowledge in your area. The responsibility that you now have to develop your area by increasing sales sand reducing costs is a heavy one. Knowing where to start will be the first of a career full of judgements that you will have to make and where you'll be accountable for the outcomes. If that sounds exciting, we might like to meet you."
                },
                {
                    "text": "Reinforce your on-the job training by learning from experienced managers and colleagues before making any key decisions",
                    "response": "Your initial training will certainly equip you with the basic knowledge in your area. The responsibility that you now have to develop your area by increasing sales sand reducing costs is a heavy one. Knowing where to start will be the first of a career full of judgements that you will have to make and where you'll be accountable for the outcomes. If that sounds exciting, we might like to meet you."
                },
                {
                    "text": "Aim to identify the problems in the area and resolve to have them dealt with ASAP",
                    "response": "Your initial training will certainly equip you with the basic knowledge in your area. The responsibility that you now have to develop your area by increasing sales and reducing costs is a heavy one. Knowing where to start will be the first of a career full of judgements that you will have to make and where you'll be accountable for the outcomes. If that sounds exciting, we might like to meet you."
                },
                {
                    "text": "Take it easy. After all, you deserve it. You've made it, so sit back and enjoy being the boss.",
                    "response": "Take it easy? Do nothing? Maybe you should do the same and spend the next few months on the sofa loafing until your dream job opportunity lands on your lap? No, taking your stores to the next stage requires new levels of energy and enthusiasm. But to be honest, having completed 11 months of training, there would be no way you'd have survived this long with that kind of 'wait and see' attitude."
                }
            ]
        },
        {
            "text": "Thank you for using our self-evaluation tool. We hope you found it interesting and that it's helped you find out a little more about us and our approach and whether we are the right kind of company for you. If you think you've got what it takes, apply today."
        }
    ]
}