{
	"route" : [
	{
		"text": "Which industry do you currently work in?",
		"answers" : 
		[
			{
				"text" : "Unemployed",
				"response" : "So tell us what else you have been doing and about the impact you've had. We assume no previous retail knowledge and ensure that the training we provide will comprehensively equip you for the role but whatever you have could serve you well. Your recruitment will be influenced by your attitude, approach and desire to adopt and absorb the Aldi culture and systems."
			},
			{
				"text" : "Public sector",
				"response" : "Fancy a change? What matters is how your experience has developed you rather than where you have worked. Show us how the experience you have can be adapted to a fast-paced retail environment. We assume no previous retail knowledge and ensure that the training we provide will comprehensively equip you for the role. Your recruitment will be influenced by your attitude, approach and desire to adopt and absorb the Aldi culture and systems."
			},
			{
				"text" : "Private sector",
				"response" : "A track record of success in your career to date is a strong indicator of what you may achieve in the future, so tell us about the impact you've had and why you think you would be suited to a fast-paced retail environment."
			},
			{
				"text" : "Retail/Distribution",
				"response" : "Great! Although we assume no previous retail knowledge, previous experience will put you in good stead. What matters is how your experience has developed you rather than where you have worked. A track record of success in your career to date is a strong indicator of what you may achieve in the future, so tell us about the impact you've had. Your recruitment will be influenced by your attitude, approach and desire to adopt and absorb the Aldi culture and systems."
			},
			{
				"text" : "Self employed",
				"response" : "Sounds interesting – you must have all kinds of great experience. We want to know all about it. We assume no previous retail knowledge and ensure that the training we provide will comprehensively equip you for the role but whatever you have could serve you well. Your recruitment will be influenced by your attitude, approach and desire to adopt and absorb the Aldi culture and systems."
			}
		]
	},
	{
		"text": "Why do you want to change job/career?",
		"answers" : 
		[
			{
				"text" : "Want better prospects",
				"response" : "An Area Manager after one year – what better prospects could there be? It'll be a challenging journey to get there and requires impressive levels of drive and commitment. In return for all your hard work, the role offers responsibility, an exceptional package and impressive opportunities."
			},
			{
				"text" : "Need a challenge",
				"response" : "We'll offer challenge, responsibility, rewards and prospects. However, it won't be without its sacrifices. Working for Aldi requires impressive levels of drive, commitment and flexibility to match our expectations. Bear in mind that retailing is not for everyone; think carefully about what it will mean for you."
			},
			{
				"text" : "Need more stimulation",
				"response" : "There's never a dull moment at Aldi! The role comprises a lot of challenge and responsibility and in return we'll offer you excellent rewards and prospects. However, it won't be without its sacrifices. Working for Aldi requires impressive levels of drive, commitment and flexibility to match our expectations. Bear in mind that retailing is not for everyone; think carefully about what it will mean for you."
			},
			{
				"text" : "Want responsibility",
				"response" : "We'll give you responsibility! An area manager role demands you take a lot of it. We'll also offer challenge, rewards and impressive prospects. However, it won't be without its sacrifices. Working for Aldi requires impressive levels of drive, commitment and flexibility to match our expectations. Bear in mind that retailing is not for everyone; think carefully about what it will mean for you."
			}
		]
	},
	{
		"text": "What leisure activities are you involved in?",
		"answers" : 
		[
			{
				"text" : "Sport",
				"response" : "You're a team player then? Strong teamwork skills are essential for an Area Manager role, as are being able to demonstrate ability in leadership, organisation and social skills, as you will be interacting with all sorts of people over the year and developing your own character too. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
			},
			{
				"text" : "Music/Drama",
				"response" : "We like to put on a good show too at Aldi. Dramatics aside, we need you to show us skills such as teamwork, leadership, organisation and commitment. As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is also essential. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
			},
			{
				"text" : "Socialising",
				"response" : "As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is essential. Tell us how you think your social life puts you in good stead for the position. We also want to see ways in which you have demonstrated teamwork, leadership, organisation and commitment. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
			},
			{
				"text" : "Travel",
				"response" : "What have you done that will help you travel to an Area Manager role? We want to see ways in which you have demonstrated teamwork, leadership, organisation and commitment – these will all put you in good stead in your work as an Area Manager. As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is also essential. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
			},
			{
				"text" : "Voluntary work",
				"response" : "Sounds interesting – we look forward to hearing about it. If your preferred leisure activity involves teamwork, leadership, organisation and commitment, then it will stand you in good stead in your work as an Area Manager. As the role is predominantly a people development role, being able to demonstrate that you have excellent social skills and are capable of motivating a team is essential. One word of warning; the demands of the Area Management Programme will mean that you might not have the time to pursue your leisure activities with quite as much vigour as before."
			}
		]
	},
	{
		"text": "Why do you want to work at Aldi?",
		"answers" : 
		[
			{
				"text" : "The money is fantastic",
				"response" : "If the salary is the only thing that matters to you, maybe we should end our interest right here? Sure, we offer a market-leading remuneration package, but it's aimed at rewarding you for your time, effort and achievement in one of the most demanding and challenging training programmes in UK management. So if money is your main motivation, save yourself a stamp, don't bother sending us your application."
			},
			{
				"text" : "It sounds challenging",
				"response" : "We like the sound of you. The Aldi Graduate Scheme will definitely offer you that challenge. In return, we offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities."
			},
			{
				"text" : "Amazing prospects",
				"response" : "An Area Manager after one year – what better prospects could there be? It will be a challenging journey getting there but in return for all your hard work, we offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities"
			},
			{
				"text" : "For the chance to succeed",
				"response" : "In this fast-paced retail environment, return on personal investment couldn't be higher. We're looking for that person who is determined to go far, but willing to work to get there. In return, we offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities."
			},
			{
				"text" : "I want to work in retail",
				"response" : "Well you are looking in the right place! Aldi is a fast-paced retail environment, where you will have a lot asked of you but the experience you gain will be invaluable in your career development. We offer an exceptional package, the market-leading package at that, combining an attractive salary with impressive opportunities in return for your hard work and dedication."
			}
		]
	},
	{
		"text": "Which of the following describes you?",
		"answers" : 
		[
			{
				"text" : "Focused",
				"response" : "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides. Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
			},
			{
				"text" : "Flexible",
				"response" : "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
			},
			{
				"text" : "Intelligent",
				"response" : "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
			},
			{
				"text" : "Resourceful",
				"response" : "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
			},
			{
				"text" : "Charismatic",
				"response" : "If you wanted to tick EACH of the boxes, we'd like to hear from you. To succeed as an Aldi Area Manager you'll need to be ALL of these and more besides.Being an Area Manager will require every facet of your personality to work in in harmony to achieve the exacting standards we set. Are you everything we need you to be? Have you got what it takes?"
			}
		]
	},
	{
		"text": "Thank you for using our self-evaluation tool. We hope you found it interesting and that it's helped you find out a little more about us and our approach and whether we are the right kind of company for you. If you think you've got what it takes, apply today."
	}
] }